app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products"  ORDER BY "products"."id" DESC
---
  def index
    @products = Product.order(id: :desc).all

INSERT INTO "products" ("name", "description", "category_id", "quantity", "image", "price_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    if @product.save