app/controllers/products_controller.rb

SELECT "products".* FROM "products"  ORDER BY "products"."created_at" DESC
---
  def index
    @products = Product.all.order(created_at: :desc)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 11]]
---
  def show
    @product = Product.find params[:id]