app/views/layouts/_top_nav.html.erb

          <ul class="dropdown-menu">
            <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"